Repository: kenanturan/rez
Catalog: rezervasyon/*.lproj/Localizable.strings
Languages: tr

# email_placeholder
source: Email
tr: E-posta

# password_placeholder
source: Password
tr: Şifre

# login_button_title
source: Login
tr: Giriş Yap

# empty_fields_error
source: Please fill in all fields.
tr: Lütfen tüm alanları doldurun.

# login_error
source: An error occurred while logging in:
tr: Giriş yapılırken hata oluştu:

# logoutButtonTitle
source: Logout
tr: Çıkış Yap

# addCourseButtonTitle
source: Add Course
tr: Ders Ekle

# addUserButtonTitle
source: Add User
tr: Kullanıcı Ekle

# viewReservedUsersButtonTitle
source: View Reserved Users
tr: Rezervasyon Yapanlar

# listCoursesButtonTitle
source: List Courses
tr: Dersleri Listele

# myReservationsButtonTitle
source: My Reservations
tr: Rezervasyonlarım

# addUserAlertTitle
source: Add User
tr: Kullanıcı Ekle

# addUserAlertMessage
source: Enter email and password
tr: E-posta ve şifre girin

# emailPlaceholder
source: Email
tr: E-posta

# passwordPlaceholder
source: Password
tr: Şifre

# addActionTitle
source: Add
tr: Ekle

# cancelActionTitle
source: Cancel
tr: İptal

# courseNameLabel
source: Course Name: %@
tr: Ders Adı: %@

# courseDateLabel
source: Course Date: %@
tr: Ders Tarihi: %@

# startTimeLabel
source: Start Time: %@
tr: Başlama Saati: %@

# endTimeLabel
source: End Time: %@
tr: Bitiş Saati: %@

# capacityLabel
source: Capacity: %@
tr: Kapasite: %@

# reserveButtonTitle
source: Reserve
tr: Rezervasyon Yap

# cancelReservationButtonTitle
source: Cancel Reservation
tr: Rezervasyon İptali

# reservationSuccessMessage
source: Your reservation for %@ has been made.
tr: %@ için rezervasyonunuz yapılmıştır.

# reservationCancelSuccessMessage
source: Your reservation for %@ has been canceled.
tr: %@ için rezervasyonunuz iptal edilmiştir.

# capacityFullErrorMessage
source: There are no spots available for this course or you have already made a reservation.
tr: Bu ders için yer kalmamıştır ya da zaten rezervasyon yapmışsınız.

# notReservedErrorMessage
source: You have not made a reservation for this course.
tr: Bu ders için rezervasyon yapmamışsınız.

# reservationErrorMessage
source: You have already made a reservation for this course.
tr: Zaten bu ders için rezervasyon yapmışsınız.

# errorTitle
source: Error
tr: Hata

# errorMessage
source: An error occurred. Please try again.
tr: Bir hata oluştu. Lütfen tekrar deneyin.

# courseNamePlaceholder
source: Course Name %@
tr: Ders Adı

# courseCapacityPlaceholder
source: Course Capacity %@
tr: Ders Kapasitesi

# addButtonTitle
source: Add %@
tr: Ekle

# courseNameEmptyError
source: Please enter the course name. %@
tr: Lütfen ders adını girin.

# validCourseCapacityError
source: Please enter a valid course capacity.
tr: Lütfen geçerli bir ders kapasitesi girin.

# courseAdditionError
source: An error occurred while adding the course:
tr: Ders eklenirken hata:

# courseAddedSuccess
source: The course was added successfully!
tr: Ders başarıyla eklendi!

# successTitle
source: Success
tr: Başarılı

# okActionTitle
source: OK
tr: Tamam

# errorFetchingReservations
source: Error occurred while fetching reservations: %@
tr: Rezervasyonları getirirken hata oluştu: %@

# confirmDeleteTitle
source: Delete Course
tr: Ders Silme

# confirmDeleteMessage
source: Are you sure you want to delete this course?
tr: Bu dersi silmek istediğinizden emin misiniz?

source: Yes
tr: Evet

source: Cancel
tr: İptal

source: Error fetching courses: %@
tr: Dersler çekilirken hata oluştu: %@

source: Error deleting course: %@
tr: Ders silinirken hata oluştu: %@

# reservationCellIdentifier
source: reservationCell
tr: rezervasyonHücresi

# reservationsTitle
source: Your Reservations
tr: Rezervasyonlarınız

# detailTitle
source: Reservation Details
tr: Rezervasyon Detayları

# courseNameTitle
source: Course Name
tr: Kurs Adı

# capacityPrefix
source: Capacity: %@
tr: Kontenjan: %@
